In [1]:
# Importing important Library
#!pip install ipython-sql
import sqlite3
# Then load the SQL module:
%load_ext sql
#connection string to connect to the database
%sql sqlite://

In [2]:
%%sql
-- This create the table name personal
CREATE TABLE personal (
    Empno integer NOT NULL UNIQUE,
    Name varchar(255) NOT NULL,
    DoB date CHECK (Dob > '1960-01-12'),
    Nativeplace varchar(255),
    Hobby varchar(255) NOT NULL
);

-- This create the table name job
CREATE TABLE job (
    sno integer NOT NULL UNIQUE,
    Area varchar(255) NOT NULL,
    App_date date,
    Salary integer CHECK (Salary BETWEEN 4000 AND 10000),
    Retd_date date,
    Dept varchar(255) NOT NULL
);

 * sqlite://
Done.
Done.

[]

In [3]:
%%sql
INSERT into personal values(123,'Amit','1965-01-23','Delhi','Music');
INSERT into personal values(127,'Manoj','1976-12-12','Mumbai','Writing');
INSERT into personal values(124,'Abhai','1975-08-11','Allahabad','Music');
INSERT into personal values(125,'Vinod','1977-04-04','Delhi','Sports');
INSERT into personal values(128,'Abhay','1974-10-03','Mumbai','Gardening');
INSERT into personal values(129,'Ramesh','1981-10-28','Pune','Sports');

INSERT into job values(123,'Agra','2006-01-25',5000,'2026-01-25','Marketing');
INSERT into job values(127,'Mathura','2006-12-22',6000,'2026-12-22','Finance');
INSERT into job values(124,'Agra','2007-08-19',5500,'2027-08-19','Marketing');
INSERT into job values(125,'Delhi','2004-04-14',8500,'2026-04-14','Marketing');
INSERT into job values(128,'Pune','2008-03-13',7500,'2026-01-25','Sales');
INSERT into job values(129,'Surat','2005-01-20',9000,'2028-03-13','Sales');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [7]:
%%sql%%sql
SELECT * FROM personal;

UsageError: Cell magic `%%sql%%sql` not found.

In [5]:
%%sql
SELECT * FROM job;

 * sqlite://
Done.

[(123, 'Agra', '2006-01-25', 5000, '2026-01-25', 'Marketing'),
 (127, 'Mathura', '2006-12-22', 6000, '2026-12-22', 'Finance'),
 (124, 'Agra', '2007-08-19', 5500, '2027-08-19', 'Marketing'),
 (125, 'Delhi', '2004-04-14', 8500, '2026-04-14', 'Marketing'),
 (128, 'Pune', '2008-03-13', 7500, '2026-01-25', 'Sales'),
 (129, 'Surat', '2005-01-20', 9000, '2028-03-13', 'Sales')]

## 1. Show number of employee area wise

In [6]:
%%sql
SELECT Area, COUNT(*) AS "Number of Employee"
FROM job
GROUP BY Area;

 * sqlite://
Done.

[('Agra', 2), ('Delhi', 1), ('Mathura', 1), ('Pune', 1), ('Surat', 1)]

## 2. Show the hobbies and native places of those whose name pronounces as 'Abhay'.

In [7]:
%%sql
SELECT Hobby,Nativeplace
FROM personal
WHERE Name = 'Abhay';

 * sqlite://
Done.

[('Gardening', 'Mumbai')]

## 3. Increase salary of the employees by 5% of their present salary with hobby as Music

In [8]:
%%sql
UPDATE job
SET 
    Salary = Salary * 1.05
WHERE 
    sno IN ( SELECT Empno
            FROM personal
            WHERE Hobby = "Music"
    );

 * sqlite://
2 rows affected.

[]

In [9]:
%%sql
SELECT * FROM job;

 * sqlite://
Done.

[(123, 'Agra', '2006-01-25', 5250, '2026-01-25', 'Marketing'),
 (127, 'Mathura', '2006-12-22', 6000, '2026-12-22', 'Finance'),
 (124, 'Agra', '2007-08-19', 5775, '2027-08-19', 'Marketing'),
 (125, 'Delhi', '2004-04-14', 8500, '2026-04-14', 'Marketing'),
 (128, 'Pune', '2008-03-13', 7500, '2026-01-25', 'Sales'),
 (129, 'Surat', '2005-01-20', 9000, '2028-03-13', 'Sales')]

## 4.Show the hobby of which there are 2 or more employees

In [10]:
%%sql
SELECT Hobby, COUNT(*) As 'Number of Empolyee'
FROM Personal
GROUP BY Hobby
HAVING COUNT(Hobby) >= 2;

 * sqlite://
Done.

[('Music', 2), ('Sports', 2)]

## 5. Show the appointment date & native place of those whose name starts with 'A' or ends with 'd'

In [11]:
%%sql
SELECT job.App_date, personal.Nativeplace
FROM personal INNER JOIN job
ON personal.Empno = job.Sno
WHERE Name LIKE 'A%' OR 'd%'

 * sqlite://
Done.

[('2006-01-25', 'Delhi'),
 ('2007-08-19', 'Allahabad'),
 ('2008-03-13', 'Mumbai')]

# 6. Count the number of native places

In [12]:
%%sql 
SELECT DISTINCT COUNT(Nativeplace) AS 'UNIQUE NATIVE PLACE'
FROM personal;

 * sqlite://
Done.

[(6,)]

# 7. Show the average salary of all employees of Agra and Delhi

In [13]:
%%sql
SELECT Area, AVG(Salary) AS 'Average Salary'
FROM job
GROUP BY AREA
HAVING AREA IN ('Agra','Delhi');

 * sqlite://
Done.

[('Agra', 5512.5), ('Delhi', 8500.0)]

# 8. Show the name of eldest employee

In [14]:
%%sql
SELECT name AS 'Eldest mployee'
FROM personal
ORDER BY Dob LIMIT 1;

 * sqlite://
Done.

[('Amit',)]

## 9. Show the salary expense with suitable column heading of those who shall retire after Jan-2026

In [15]:
%%sql
SELECT SUM(Salary) AS 'Salary Expense'
FROM job
WHERE Retd_date	> '2026-01-01';

 * sqlite://
Done.

[(42025,)]

## 10.  Show empno, area, appointment date, department of the employees

In [16]:
%%sql 
SELECT Empno, Area, App_date, Dept
FROM personal INNER join JOB
ON personal.Empno = job.Sno;

 * sqlite://
Done.

[(123, 'Agra', '2006-01-25', 'Marketing'),
 (127, 'Mathura', '2006-12-22', 'Finance'),
 (124, 'Agra', '2007-08-19', 'Marketing'),
 (125, 'Delhi', '2004-04-14', 'Marketing'),
 (128, 'Pune', '2008-03-13', 'Sales'),
 (129, 'Surat', '2005-01-20', 'Sales')]

## 11. Add a new column email in Job table

In [17]:
%%sql
ALTER TABLE Job
ADD Email varchar(255);

 * sqlite://
Done.

[]

In [18]:
%%sql
SELECT * FROM job;

 * sqlite://
Done.

[(123, 'Agra', '2006-01-25', 5250, '2026-01-25', 'Marketing', None),
 (127, 'Mathura', '2006-12-22', 6000, '2026-12-22', 'Finance', None),
 (124, 'Agra', '2007-08-19', 5775, '2027-08-19', 'Marketing', None),
 (125, 'Delhi', '2004-04-14', 8500, '2026-04-14', 'Marketing', None),
 (128, 'Pune', '2008-03-13', 7500, '2026-01-25', 'Sales', None),
 (129, 'Surat', '2005-01-20', 9000, '2028-03-13', 'Sales', None)]

## 12. Create a view of personal and job details of those who have served less than 15 years

In [8]:
%%sql
SELECT App_date
FROM personal INNER JOIN job
ON personal.Empno = job.Sno
WHERE App_date < date('now','-15 years');

 * sqlite://
Done.

[('2004-04-14',), ('2005-01-20',)]

In [7]:
%%sql
SELECT * FROM personal INNER
WHERE YEAR(CURRENT_DATE()) - YEAR(App_date) < 15;

 * sqlite://
(sqlite3.OperationalError) near "(": syntax error
[SQL: SELECT * FROM job
WHERE YEAR(CURRENT_DATE()) - YEAR(App_date) < 15;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [ ]:
SELECT * 
FROM personal INNER JOIN job
ON personal.Empno = job.Sno
WHERE YEAR(CURRENT_DATE()) - YEAR(App_date) > 15